input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:glob="http://sap.com/xi/SAPGlobal20/Global">
   <soapenv:Header/>
   <soapenv:Body>
      <glob:CustReqBundleMaintainRequest_sync>
         <CustomerRequirement ActionCode="01">
            <ShipFromSiteID>MHMUMADH-T0201</ShipFromSiteID>
            <ShipToSiteID>MHMUMADH-T0401</ShipToSiteID>
            <ShipToLocationID>MHMUMADH-T0401</ShipToLocationID>
            <ExternalRquestItem ActionCode="01">
               <ItemID>10</ItemID>
               <ProductKey>
                  <ProductTypeCode>1</ProductTypeCode>
                  <ProductIdentifierTypeCode>1</ProductIdentifierTypeCode>
                  <ProductID>10000003</ProductID>
               </ProductKey>
               <RequestedQuantity unitCode="EA">3</RequestedQuantity>
               <RequestedLocalDateTime timeZoneCode="UTC">2012-08-01T00:00:00Z</RequestedLocalDateTime>
               <Description languageCode="EN">Cotton Packet</Description>
            </ExternalRquestItem>
            <ExternalRquestItem ActionCode="01">
               <ItemID>20</ItemID>
               <ProductKey>
                  <ProductTypeCode>1</ProductTypeCode>
                  <ProductIdentifierTypeCode>1</ProductIdentifierTypeCode>
                  <ProductID>10000003</ProductID>
               </ProductKey>
               <RequestedQuantity unitCode="EA">3</RequestedQuantity>
               <RequestedLocalDateTime timeZoneCode="UTC">2012-08-01T00:00:00Z</RequestedLocalDateTime>
               <Description languageCode="EN">Cotton Packet</Description>
            </ExternalRquestItem>
         </CustomerRequirement>
      </glob:CustReqBundleMaintainRequest_sync>
   </soapenv:Body>
</soapenv:Envelope>
